{
    "subjectName": "Industrial Management and Entrepreneurship",
    "subjectCode": "ME-501",
    "semester": "C-21 5th Sem",
    "recurringTopics": [
        {
            "title": "Quality Systems & ISO 9000",
            "desc": "ISO 9000 series standards, TQM (Total Quality Management), 5-S Principles, Zero Defect, and Quality Assurance benefits.",
            "frequency": "High"
        },
        {
            "title": "Industrial Safety & Legislation",
            "desc": "Indian Factories Act 1948 (Safety, Health & Welfare provisions), Causes of industrial accidents, and Safety measures (4 E's).",
            "frequency": "High"
        },
        {
            "title": "Entrepreneurship & Start-ups",
            "desc": "Definition & Qualities of Entrepreneur, Entrepreneur vs Manager, Start-up India schemes, DIC, and MSME support.",
            "frequency": "High"
        },
        {
            "title": "Principles of Management",
            "desc": "Functions of management (POSDC), Henry Fayol's 14 Principles, F.W. Taylor's Scientific Management.",
            "frequency": "Medium"
        },
        {
            "title": "Project Management (PERT/CPM)",
            "desc": "Difference between PERT and CPM, Network Analysis, Drawing Network Diagrams, Critical Path.",
            "frequency": "Medium"
        },
        {
            "title": "Inventory Control",
            "desc": "ABC Analysis (Always Better Control), EOQ (Economic Order Quantity), Bin Card vs Stores Ledger.",
            "frequency": "Medium"
        },
        {
            "title": "Organizational Structure",
            "desc": "Line Organization, Line and Staff Organization, Functional Organization (Advantages & Disadvantages).",
            "frequency": "Medium"
        }
    ],
    "likelyQuestions": [
        {
            "title": "Explain Start-up India schemes and registration benefits.",
            "desc": "Discuss features, eligibility, tax exemptions, and government support like MUDRA/Stand-Up India.",
            "probability": "90%"
        },
        {
            "title": "Explain ISO 9000 series constituents, benefits, and drawbacks.",
            "desc": "Define ISO 9001, 9004, and list internal/external benefits and documentation costs.",
            "probability": "88%"
        },
        {
            "title": "State the salient features of the Indian Factories Act, 1948.",
            "desc": "Focus specifically on Safety (fencing), Health (cleanliness), and Welfare (canteens/creches) provisions.",
            "probability": "85%"
        },
        {
            "title": "Write a short note on 5-S principles and TQM.",
            "desc": "Explain Seiri, Seiton, Seiso, Seiketsu, Shitsuke and the concept of continuous improvement.",
            "probability": "82%"
        },
        {
            "title": "Define Entrepreneur. Explain qualities and role in economic development.",
            "desc": "Discuss characteristics (Risk-taker, Innovator) and contribution to employment/GDP.",
            "probability": "78%"
        },
        {
            "title": "Differentiate between PERT and CPM.",
            "desc": "Compare based on Time estimates (Probabilistic vs Deterministic), Focus (Time vs Cost), and Application.",
            "probability": "75%"
        },
        {
            "title": "Explain ABC Analysis in inventory control with a graph.",
            "desc": "Classify items into A, B, C categories based on value and volume. Draw the graph.",
            "probability": "70%"
        },
        {
            "title": "Explain Line and Staff Organization with a diagram.",
            "desc": "Show the relationship between Line officers (Command) and Staff officers (Advisory).",
            "probability": "65%"
        }
    ],
    "commonTypes": [
        {
            "title": "Definitions (Part A - 2/3 Marks)",
            "desc": "Define Management, Entrepreneur, ISO, TQM, Safety, Sole Proprietorship, Market Survey.",
            "type": "Short"
        },
        {
            "title": "Distinguish Between (Part B - 5 Marks)",
            "desc": "PERT vs CPM, Line vs Staff Organization, Entrepreneur vs Manager, Administration vs Management.",
            "type": "Medium"
        },
        {
            "title": "Essay Questions (Part C - 10 Marks)",
            "desc": "Explain ISO 9000 series in detail. Describe the steps in a Feasibility Study. Salient features of Factories Act.",
            "type": "Long"
        },
        {
            "title": "Analytical/Diagrams (Part B/C)",
            "desc": "Draw PERT Network Diagram for given data, ABC Analysis Graph, Maslow's Hierarchy Pyramid.",
            "type": "Medium"
        },
        {
            "title": "Short Notes (Part B - 3/5 Marks)",
            "desc": "Write short notes on: 5-S Principles, Functions of DIC, Causes of Accidents, Leadership Styles.",
            "type": "Short"
        }
    ]
}